app/controllers/admin_controller.rb

def index
  @users = User.paginate(page: params[:page])
  @pending_services = Service.where(status: 'En proceso')
---
SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
SELECT `services`.* FROM `services` WHERE `services`.`status` = 'En proceso'  ORDER BY `services`.`created_at` DESC

def services
  @pending_services = Service.all
---
SELECT `services`.* FROM `services`  ORDER BY `services`.`created_at` DESC

def drivers
  @drivers = User.where(driver: true)
---
SELECT `users`.* FROM `users` WHERE `users`.`driver` = 1