app/controllers/services_controller.rb

def create
    @service = current_user.services.build(service_params)
    if @service.save
---
INSERT INTO `services` (`addr_from`, `addr_to`, `num_passengers`, `payment_method`, `type_vehicle`, `status`, `date`, `time`, `user_id`, `created_at`, `updated_at`) VALUES ('av benavides 1523 surco', 'calle mariano melgar, jesus maria', 2, 'visa', 'sedan', 'En proceso', '2015-09-21', '2015-09-21 01:50:00.000000', 2, '2015-09-21 01:50:46', '2015-09-21 01:50:46')

def show
  @service = Service.find(params[:id])
  @user = User.find(@service.user_id)
---
SELECT  `services`.* FROM `services` WHERE `services`.`id` = 148  ORDER BY `services`.`created_at` DESC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 15 LIMIT 1

def edit
  @service = Service.find(params[:id])
  if current_user.admin?
    @drivers = User.where(driver: true, active: true)
---
SELECT  `services`.* FROM `services` WHERE `services`.`id` = 144  ORDER BY `services`.`created_at` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`driver` = 1 AND `users`.`active` = 1

  def update
    @service = Service.find(params[:id])
    respond_to do |format|
      if @service.update(service_params)
---
SELECT  `services`.* FROM `services` WHERE `services`.`id` = 144  ORDER BY `services`.`created_at` DESC LIMIT 1
UPDATE `services` SET `status` = 'Asignado', `driver_id` = 2, `time` = '2000-01-01 05:17:00.000000', `updated_at` = '2015-09-22 05:22:37' WHERE `services`.`id` = 2