app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`correo` = 'user@example.com' LIMIT 1
---
  def create
    user = User.find_by(correo: params[:session][:correo].downcase)