app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`

  def show
    @user = User.find(params[:id])
#    @services = @user.services.paginate(page: params[:page])
    if logged_in?
      @service = current_user.services.build
      @past_services = current_user.user_services.paginate(page: params[:page])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT  `services`.* FROM `services` WHERE `services`.`user_id` = 100  ORDER BY `services`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `services` WHERE `services`.`user_id` = 100

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`nombre`, `apellido`, `correo`, `password_digest`, `driver`, `active`, `created_at`, `updated_at`) VALUES ('Carlos', 'Martinez', 'cmartinez@gmail.com', '$2a$10$x/qmBIoetHnF8pQ1LuM3Zednb/jO/g0iTgChBcVfsbKWuKJvVsMtm', 1, 0, '2015-09-22 08:00:01', '2015-09-22 08:00:01')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$r0s36iAxnYrKrpvyubsxKeahDKYJAvvfG6RpC6AsjrUp5GKIuQWEy', `active` = 1, `updated_at` = '2015-09-22 06:26:09' WHERE `users`.`id` = 5

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM `users` WHERE `users`.`id` = 100
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 100 LIMIT 1

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1